# Iterating Over a DataFrame

In [1]:
import pandas as pd
diSales={'yr1':{'Qtr1':34500,'Qtr2':56000,'Qtr3':47000,'Qtr4':49000},\
         'yr2':{'Qtr1':44900,'Qtr2':46100,'Qtr3':57000,'Qtr4':59000},\
         'yr3':{'Qtr1':54500,'Qtr2':51000,'Qtr3':57000,'Qtr4':58500}}
df1=pd.DataFrame(diSales)
df1

        yr1    yr2    yr3
Qtr1  34500  44900  54500
Qtr2  56000  46100  51000
Qtr3  47000  57000  57000
Qtr4  49000  59000  58500

df.iterrows()  : Views DF in the form of Horizontal subsets (row-wise)
                 Where each Horizontal subset is in the form of (row-index,Series)
                 Where Series contains all column values for that row-index.
df.iteritems() : Views DF in the form of Vertical subsets (column-wise)
                 Where each Vertical subset is in the form of (column-index,Series)
                 Where Series contains all row values for that column-index.

 Each row is taken one at a time in the form of 'row':row-index and 'rowSeries':all values of the row.

In [2]:
for(row,rowSeries) in df1.iterrows():             
    print("Row index:",row)                       # Row-index
    print("Containing:")
    print(rowSeries)                              # All Values in a row are in the form of a Series object
    print("\n")

Row index: Qtr1
Containing:
yr1    34500
yr2    44900
yr3    54500
Name: Qtr1, dtype: int64


Row index: Qtr2
Containing:
yr1    56000
yr2    46100
yr3    51000
Name: Qtr2, dtype: int64


Row index: Qtr3
Containing:
yr1    47000
yr2    57000
yr3    57000
Name: Qtr3, dtype: int64


Row index: Qtr4
Containing:
yr1    49000
yr2    59000
yr3    58500
Name: Qtr4, dtype: int64

 Each column is taken one at a time in the form of 'col':col-index and 'colSeries':all values of the column.

In [3]:
for(col,colSeries) in df1.iteritems():
    print("Column index:",col)                # Col-index
    print("Containing:")
    print(colSeries)                          # All values in a column are in form of a Series object
    print("\n")

Column index: yr1
Containing:
Qtr1    34500
Qtr2    56000
Qtr3    47000
Qtr4    49000
Name: yr1, dtype: int64


Column index: yr2
Containing:
Qtr1    44900
Qtr2    46100
Qtr3    57000
Qtr4    59000
Name: yr2, dtype: int64


Column index: yr3
Containing:
Qtr1    54500
Qtr2    51000
Qtr3    57000
Qtr4    58500
Name: yr3, dtype: int64

In [4]:
for(row,rowSeries) in df1.iterrows():
    print("\n")
    print("Row index:",row)
    print("Containing:")
    i=0
    for val in rowSeries:
        print("At",i,"position:",val)     # We can iterate over the Series object obtained from iterrows()
        i=i+1

Row index: Qtr1
Containing:
At 0 position: 34500
At 1 position: 44900
At 2 position: 54500


Row index: Qtr2
Containing:
At 0 position: 56000
At 1 position: 46100
At 2 position: 51000


Row index: Qtr3
Containing:
At 0 position: 47000
At 1 position: 57000
At 2 position: 57000


Row index: Qtr4
Containing:
At 0 position: 49000
At 1 position: 59000
At 2 position: 58500

In [5]:
import pandas as pd
dict={'name':["Ram","Pam","Sam"],
     'Marks':[70,95,80]}
df2=pd.DataFrame(dict,index=['Rno.1','Rno.2','Rno.3'])
df2

      name  Marks
Rno.1  Ram     70
Rno.2  Pam     95
Rno.3  Sam     80

In [6]:
for i,j in df2.iterrows():
    print(j)
    print("-----------")

name     Ram
Marks     70
Name: Rno.1, dtype: object
-----------
name     Pam
Marks     95
Name: Rno.2, dtype: object
-----------
name     Sam
Marks     80
Name: Rno.3, dtype: object
-----------

In [7]:
for i,j in df2.iteritems():
    print(j)
    print("-----------")

Rno.1    Ram
Rno.2    Pam
Rno.3    Sam
Name: name, dtype: object
-----------
Rno.1    70
Rno.2    95
Rno.3    80
Name: Marks, dtype: int64
-----------

Printing individual Column from a Row

In [10]:
for r,row in df2.iterrows():
    print(row['Marks'])
    print("---------")

70
---------
95
---------
80
---------